mostangrymike/ovms-agent/SRC/M289_NATIVE_BUILD_TEST.C
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "command_internal.h"
#include "llm_internal.h"
#include "M289_NATIVE_BUILD.H"

#define TEST_COMMAND_MAX 512U

static int exec_mode = 0;
static unsigned int exec_calls = 0U;
static char exec_first[TEST_COMMAND_MAX];
static char exec_second[TEST_COMMAND_MAX];

int llm_path_is_safe(const char *path)
{
    if (path == NULL || *path == '\0') {
        return 0;
    }
    if (strstr(path, "..") != NULL ||
        strchr(path, ':') != NULL ||
        path[0] == '/' || path[0] == '\\') {
        return 0;
    }
    return 1;
}

static void record_exec(const char *command)
{
    ++exec_calls;
    if (exec_calls == 1U) {
        (void)strncpy(exec_first, command, sizeof(exec_first) - 1U);
        exec_first[sizeof(exec_first) - 1U] = '\0';
    } else if (exec_calls == 2U) {
        (void)strncpy(exec_second, command, sizeof(exec_second) - 1U);
        exec_second[sizeof(exec_second) - 1U] = '\0';
    }
}

int command_dcl_exec(agent_state *state,
                     const char *command,
                     char *output,
                     size_t output_size,
                     unsigned long *status_out)
{
    const char *text;
    int fortran_compile;
    int cobol_compile;
    int pascal_compile;
    int cxx_compile;
    int java_compile;
    int basic_compile;
    int python_run;
    int perl_run;

    (void)state;
    if (command == NULL || output == NULL || output_size == 0U ||
        status_out == NULL) {
        return 0;
    }

    record_exec(command);

    if (exec_mode == 3) {
        (void)snprintf(output, output_size,
                       "DCL command refused: full approval policy required.\n");
        *status_out = 0UL;
        return 0;
    }

    fortran_compile = exec_calls == 1U &&
                      strncmp(command, "FORTRAN ", 8) == 0;
    cobol_compile = exec_calls == 1U &&
                    strncmp(command, "COBOL ", 6) == 0;
    pascal_compile = exec_calls == 1U &&
                     strncmp(command, "PASCAL ", 7) == 0;
    cxx_compile = exec_calls == 1U &&
                  strncmp(command, "CXX ", 4) == 0;
    java_compile = exec_calls == 1U &&
                   strncmp(command, "JAVAC ", 6) == 0;
    basic_compile = exec_calls == 1U &&
                    strncmp(command, "BASIC ", 6) == 0;
    python_run = exec_calls == 1U &&
                 strncmp(command, "PYTHON ", 7) == 0;
    perl_run = exec_calls == 1U &&
               strncmp(command, "PERL ", 5) == 0;

    if (exec_calls == 1U) {
        if (exec_mode == 1) {
            *status_out = 2UL;
            text = "compile failed\n";
        } else if (fortran_compile) {
            *status_out = 0x186A0001UL;
            text = "Fortran compile output\n";
        } else if (cobol_compile) {
            *status_out = 0x10820001UL;
            text = "COBOL compile output\n";
        } else if (pascal_compile) {
            *status_out = 0x10000001UL;
            text = "Pascal compile output\n";
        } else if (cxx_compile) {
            *status_out = 0x15F60001UL;
            text = "CXX compile output\n";
        } else if (java_compile) {
            *status_out = 0x10000001UL;
            text = "Java compile output\n";
        } else if (basic_compile) {
            *status_out = 0x10000001UL;
            text = "BASIC compile output\n";
        } else if (python_run) {
            *status_out = 0x00000001UL;
            text = "Python run output\n";
        } else if (perl_run) {
            *status_out = 0x00000001UL;
            text = "Perl run output\n";
        } else {
            *status_out = 0x107D0001UL;
            text = "MACRO compile output\n";
        }
    } else {
        if (exec_mode == 2) {
            *status_out = 2UL;
            text = "LINK failed\n";
        } else {
            *status_out = 0x10000001UL;
            text = "LINK output\n";
        }
    }

    (void)strncpy(output, text, output_size - 1U);
    output[output_size - 1U] = '\0';
    return 1;
}

int command_dcl_exec_procedure(agent_state *state,
                               const char *procedure_path,
                               char *output,
                               size_t output_size,
                               unsigned long *status_out)
{
    (void)state;
    if (procedure_path == NULL || output == NULL || output_size == 0U ||
        status_out == NULL) {
        return 0;
    }

    record_exec(procedure_path);
    if (exec_mode == 3) {
        (void)snprintf(output, output_size,
                       "DCL command refused: full approval policy required.\n");
        *status_out = 0UL;
        return 0;
    }

    *status_out = 0x00030001UL;
    (void)strncpy(output, "DCL procedure output\n", output_size - 1U);
    output[output_size - 1U] = '\0';
    return 1;
}

static void reset_exec(int mode)
{
    exec_mode = mode;
    exec_calls = 0U;
    exec_first[0] = '\0';
    exec_second[0] = '\0';
}

static int test_command_guard(void)
{
    if (!m289_command_allowed("MACRO/MIGRATION WC.MAR",
                              M289_BUILD_COMPILE, "MACRO32") ||
        !m289_command_allowed("FORTRAN WC.F90",
                              M289_BUILD_COMPILE, "FORTRAN") ||
        !m289_command_allowed("COBOL WC.COB",
                              M289_BUILD_COMPILE, "COBOL") ||
        !m289_command_allowed("PASCAL WC.PAS",
                              M289_BUILD_COMPILE, "PASCAL") ||
        !m289_command_allowed("CXX WC.CXX",
                              M289_BUILD_COMPILE, "CXX") ||
        !m289_command_allowed("JAVAC M289JavaFixture.java",
                              M289_BUILD_COMPILE, "JAVA") ||
        !m289_command_allowed("BASIC WC.BAS",
                              M289_BUILD_COMPILE, "BASIC") ||
        !m289_command_allowed("PYTHON WC.PY",
                              M289_BUILD_RUN, "PYTHON") ||
        !m289_command_allowed("PERL WC.PL",
                              M289_BUILD_RUN, "PERL") ||
        !m289_command_allowed("M289_DCL_FIXTURE.COM",
                              M289_BUILD_RUN, "DCL") ||
        !m289_command_allowed("LINK WC.OBJ",
                              M289_BUILD_LINK, "MACRO32") ||
        !m289_command_allowed("LINK WC.OBJ",
                              M289_BUILD_LINK, "FORTRAN") ||
        !m289_command_allowed("LINK WC.OBJ",
                              M289_BUILD_LINK, "COBOL") ||
        !m289_command_allowed("LINK WC.OBJ",
                              M289_BUILD_LINK, "PASCAL") ||
        !m289_command_allowed("LINK WC.OBJ",
                              M289_BUILD_LINK, "CXX") ||
        !m289_command_allowed("LINK WC.OBJ",
                              M289_BUILD_LINK, "BASIC") ||
        m289_command_allowed("LINK WC.OBJ",
                             M289_BUILD_LINK, "JAVA") ||
        m289_command_allowed("JAVAC M289JavaFixture.java",
                             M289_BUILD_RUN, "JAVA") ||
        m289_command_allowed("M289_DCL_FIXTURE.COM",
                             M289_BUILD_COMPILE, "DCL") ||
        m289_command_allowed("M289_DCL_FIXTURE.COM",
                             M289_BUILD_LINK, "DCL") ||
        m289_command_allowed("@M289_DCL_FIXTURE.COM",
                             M289_BUILD_RUN, "DCL") ||
        m289_command_allowed("M289_DCL_FIXTURE.COM ARG",
                             M289_BUILD_RUN, "DCL") ||
        m289_command_allowed("PYTHON WC.PY",
                             M289_BUILD_RUN, "DCL") ||
        m289_command_allowed("PYTHON WC.PY",
                             M289_BUILD_COMPILE, "PYTHON") ||
        m289_command_allowed("LINK WC.OBJ",
                             M289_BUILD_LINK, "PYTHON") ||
        m289_command_allowed("PERL WC.PL",
                             M289_BUILD_COMPILE, "PERL") ||
        m289_command_allowed("LINK WC.OBJ",
                             M289_BUILD_LINK, "PERL") ||
        m289_command_allowed("CXX WC.CXX",
                             M289_BUILD_RUN, "CXX") ||
        m289_command_allowed("BASIC WC.BAS",
                             M289_BUILD_RUN, "BASIC") ||
        m289_command_allowed("PYTHON WC.PY",
                             M289_BUILD_RUN, "PERL") ||
        m289_command_allowed("PERL WC.PL",
                             M289_BUILD_RUN, "PYTHON") ||
        m289_command_allowed("MACRO/MIGRATION WC.MAR",
                             M289_BUILD_COMPILE, "FORTRAN") ||
        m289_command_allowed("FORTRAN WC.F90",
                             M289_BUILD_COMPILE, "MACRO32") ||
        m289_command_allowed("COBOL WC.COB",
                             M289_BUILD_COMPILE, "FORTRAN") ||
        m289_command_allowed("PASCAL WC.PAS",
                             M289_BUILD_COMPILE, "COBOL") ||
        m289_command_allowed("CXX WC.CXX",
                             M289_BUILD_COMPILE, "PASCAL") ||
        m289_command_allowed("JAVAC M289JavaFixture.java",
                             M289_BUILD_COMPILE, "CXX") ||
        m289_command_allowed("BASIC WC.BAS",
                             M289_BUILD_COMPILE, "JAVA") ||
        m289_command_allowed("MACRO WC.MAR",
                             M289_BUILD_COMPILE, "MACRO32") ||
        m289_command_allowed("MACRO/MIGRATION WC.MAR|DELETE *.*;*",
                             M289_BUILD_COMPILE, "MACRO32") ||
        m289_command_allowed("FORTRAN WC.F90|DELETE *.*;*",
                             M289_BUILD_COMPILE, "FORTRAN") ||
        m289_command_allowed("COBOL WC.COB|DELETE *.*;*",
                             M289_BUILD_COMPILE, "COBOL") ||
        m289_command_allowed("PASCAL WC.PAS|DELETE *.*;*",
                             M289_BUILD_COMPILE, "PASCAL") ||
        m289_command_allowed("CXX WC.CXX|DELETE *.*;*",
                             M289_BUILD_COMPILE, "CXX") ||
        m289_command_allowed("JAVAC M289JavaFixture.java|DELETE *.*;*",
                             M289_BUILD_COMPILE, "JAVA") ||
        m289_command_allowed("BASIC WC.BAS|DELETE *.*;*",
                             M289_BUILD_COMPILE, "BASIC") ||
        m289_command_allowed("PYTHON WC.PY|DELETE *.*;*",
                             M289_BUILD_RUN, "PYTHON") ||
        m289_command_allowed("PERL WC.PL|DELETE *.*;*",
                             M289_BUILD_RUN, "PERL") ||
        m289_command_allowed("M289_DCL_FIXTURE.COM|DELETE *.*;*",
                             M289_BUILD_RUN, "DCL") ||
        m289_command_allowed("LINK WC.OBJ @EVIL.COM",
                             M289_BUILD_LINK, "CXX") ||
        m289_command_allowed("LINK SYS$DISK:[X]WC.OBJ",
                             M289_BUILD_LINK, "MACRO32")) {
        (void)puts("M289 native failed: command guard.");
        return 0;
    }
    return 1;
}

static int test_macro_success(agent_state *state)
{
    char *result;
    unsigned long status;
    int ok;

