mostangrymike/ovms-agent/SRC/M289_NATIVE_BUILD_TEST.C
    reset_exec(0);
    status = 0UL;
    result = m289_build_source(state, "WC.MAR", &status);
    ok = result != NULL &&
         exec_calls == 2U &&
         strcmp(exec_first, "MACRO/MIGRATION WC.MAR") == 0 &&
         strcmp(exec_second, "LINK WC.OBJ") == 0 &&
         status == 0x10000001UL &&
         strstr(result, "Language: MACRO32") != NULL &&
         strstr(result, "Compile status: %X107D0001 (success)") != NULL &&
         strstr(result, "Link status: %X10000001 (success)") != NULL &&
         strstr(result, "Result: success") != NULL;
    if (!ok) {
        (void)printf("M289 native failed: MACRO32 success path.\n%s\n",
                     result != NULL ? result : "<null>");
    }
    free(result);
    return ok;
}

static int test_fortran_success(agent_state *state)
{
    char *result;
    unsigned long status;
    int ok;

    reset_exec(0);
    status = 0UL;
    result = m289_build_source(state, "M289_FORTRAN_FIXTURE.F90", &status);
    ok = result != NULL &&
         exec_calls == 2U &&
         strcmp(exec_first, "FORTRAN M289_FORTRAN_FIXTURE.F90") == 0 &&
         strcmp(exec_second, "LINK M289_FORTRAN_FIXTURE.OBJ") == 0 &&
         status == 0x10000001UL &&
         strstr(result, "Language: FORTRAN") != NULL &&
         strstr(result, "Compile status: %X186A0001 (success)") != NULL &&
         strstr(result, "Link status: %X10000001 (success)") != NULL &&
         strstr(result, "Result: success") != NULL;
    if (!ok) {
        (void)printf("M289 native failed: Fortran success path.\n%s\n",
                     result != NULL ? result : "<null>");
    }
    free(result);
    return ok;
}

static int test_cobol_success(agent_state *state)
{
    char *result;
    unsigned long status;
    int ok;

    reset_exec(0);
    status = 0UL;
    result = m289_build_source(state, "M289_COBOL_FIXTURE.COB", &status);
    ok = result != NULL &&
         exec_calls == 2U &&
         strcmp(exec_first, "COBOL M289_COBOL_FIXTURE.COB") == 0 &&
         strcmp(exec_second, "LINK M289_COBOL_FIXTURE.OBJ") == 0 &&
         status == 0x10000001UL &&
         strstr(result, "Language: COBOL") != NULL &&
         strstr(result, "Compile status: %X10820001 (success)") != NULL &&
         strstr(result, "Link status: %X10000001 (success)") != NULL &&
         strstr(result, "Result: success") != NULL;
    if (!ok) {
        (void)printf("M289 native failed: COBOL success path.\n%s\n",
                     result != NULL ? result : "<null>");
    }
    free(result);
    return ok;
}

static int test_pascal_success(agent_state *state)
{
    char *result;
    unsigned long status;
    int ok;

    reset_exec(0);
    status = 0UL;
    result = m289_build_source(state, "M289_PASCAL_FIXTURE.PAS", &status);
    ok = result != NULL &&
         exec_calls == 2U &&
         strcmp(exec_first, "PASCAL M289_PASCAL_FIXTURE.PAS") == 0 &&
         strcmp(exec_second, "LINK M289_PASCAL_FIXTURE.OBJ") == 0 &&
         status == 0x10000001UL &&
         strstr(result, "Language: PASCAL") != NULL &&
         strstr(result, "Compile status: %X10000001 (success)") != NULL &&
         strstr(result, "Link status: %X10000001 (success)") != NULL &&
         strstr(result, "Result: success") != NULL;
    if (!ok) {
        (void)printf("M289 native failed: Pascal success path.\n%s\n",
                     result != NULL ? result : "<null>");
    }
    free(result);
    return ok;
}

static int test_cxx_success(agent_state *state)
{
    char *result;
    unsigned long status;
    int ok;

    reset_exec(0);
    status = 0UL;
    result = m289_build_source(state, "M289_CXX_FIXTURE.CXX", &status);
    ok = result != NULL &&
         exec_calls == 2U &&
         strcmp(exec_first, "CXX M289_CXX_FIXTURE.CXX") == 0 &&
         strcmp(exec_second, "LINK M289_CXX_FIXTURE.OBJ") == 0 &&
         status == 0x10000001UL &&
         strstr(result, "Language: CXX") != NULL &&
         strstr(result, "Compile status: %X15F60001 (success)") != NULL &&
         strstr(result, "Link status: %X10000001 (success)") != NULL &&
         strstr(result, "Result: success") != NULL;
    if (!ok) {
        (void)printf("M289 native failed: CXX success path.\n%s\n",
                     result != NULL ? result : "<null>");
    }
    free(result);
    return ok;
}

static int test_basic_success(agent_state *state)
{
    char *result;
    unsigned long status;
    int ok;

    reset_exec(0);
    status = 0UL;
    result = m289_build_source(state, "M289_BASIC_FIXTURE.BAS", &status);
    ok = result != NULL &&
         exec_calls == 2U &&
         strcmp(exec_first, "BASIC M289_BASIC_FIXTURE.BAS") == 0 &&
         strcmp(exec_second, "LINK M289_BASIC_FIXTURE.OBJ") == 0 &&
         status == 0x10000001UL &&
         strstr(result, "Language: BASIC") != NULL &&
         strstr(result, "Compile status: %X10000001 (success)") != NULL &&
         strstr(result, "Link status: %X10000001 (success)") != NULL &&
         strstr(result, "Result: success") != NULL;
    if (!ok) {
        (void)printf("M289 native failed: BASIC success path.\n%s\n",
                     result != NULL ? result : "<null>");
    }
    free(result);
    return ok;
}

static int test_python_success(agent_state *state)
{
    char *result;
    unsigned long status;
    int ok;

    reset_exec(0);
    status = 0UL;
    result = m289_build_source(state, "M289_PYTHON_FIXTURE.PY", &status);
    ok = result != NULL &&
         exec_calls == 1U &&
         strcmp(exec_first, "PYTHON M289_PYTHON_FIXTURE.PY") == 0 &&
         exec_second[0] == '\0' &&
         status == 0x00000001UL &&
         strstr(result, "Language: PYTHON") != NULL &&
         strstr(result, "Run command: PYTHON M289_PYTHON_FIXTURE.PY") != NULL &&
         strstr(result, "Run status: %X00000001 (success)") != NULL &&
         strstr(result, "Python run output") != NULL &&
         strstr(result, "Compile command:") == NULL &&
         strstr(result, "Link command:") == NULL &&
         strstr(result, "Result: success") != NULL;
    if (!ok) {
        (void)printf("M289 native failed: Python success path.\n%s\n",
                     result != NULL ? result : "<null>");
    }
    free(result);
    return ok;
}

static int test_perl_success(agent_state *state)
{
    char *result;
    unsigned long status;
    int ok;

