mostangrymike/ovms-agent/SRC/M289_NATIVE_BUILD_TEST.C
    reset_exec(0);
    status = 0UL;
    result = m289_build_source(state, "M289_PERL_FIXTURE.PL", &status);
    ok = result != NULL &&
         exec_calls == 1U &&
         strcmp(exec_first, "PERL M289_PERL_FIXTURE.PL") == 0 &&
         exec_second[0] == '\0' &&
         status == 0x00000001UL &&
         strstr(result, "Language: PERL") != NULL &&
         strstr(result, "Run command: PERL M289_PERL_FIXTURE.PL") != NULL &&
         strstr(result, "Run status: %X00000001 (success)") != NULL &&
         strstr(result, "Perl run output") != NULL &&
         strstr(result, "Compile command:") == NULL &&
         strstr(result, "Link command:") == NULL &&
         strstr(result, "Result: success") != NULL;
    if (!ok) {
        (void)printf("M289 native failed: Perl success path.\n%s\n",
                     result != NULL ? result : "<null>");
    }
    free(result);
    return ok;
}

static int test_java_success(agent_state *state)
{
    char *result;
    unsigned long status;
    int ok;

    reset_exec(0);
    status = 0UL;
    result = m289_build_source(state, "M289JavaFixture.java", &status);
    ok = result != NULL &&
         exec_calls == 1U &&
         strcmp(exec_first, "JAVAC M289JavaFixture.java") == 0 &&
         exec_second[0] == '\0' &&
         status == 0x10000001UL &&
         strstr(result, "Language: JAVA") != NULL &&
         strstr(result, "Compile command: JAVAC M289JavaFixture.java") != NULL &&
         strstr(result, "Compile status: %X10000001 (success)") != NULL &&
         strstr(result, "Java compile output") != NULL &&
         strstr(result, "Link command:") == NULL &&
         strstr(result, "Run command:") == NULL &&
         strstr(result, "Result: success") != NULL;
    if (!ok) {
        (void)printf("M289 native failed: Java success path.\n%s\n",
                     result != NULL ? result : "<null>");
    }
    free(result);
    return ok;
}

static int test_dcl_success(agent_state *state)
{
    char *result;
    unsigned long status;
    int ok;

    reset_exec(0);
    status = 0UL;
    result = m289_build_source(state, "M289_DCL_FIXTURE.COM", &status);
    ok = result != NULL &&
         exec_calls == 1U &&
         strcmp(exec_first, "M289_DCL_FIXTURE.COM") == 0 &&
         exec_second[0] == '\0' &&
         status == 0x00030001UL &&
         strstr(result, "Language: DCL") != NULL &&
         strstr(result, "Procedure command: @M289_DCL_FIXTURE.COM") != NULL &&
         strstr(result, "Procedure status: %X00030001 (success)") != NULL &&
         strstr(result, "DCL procedure output") != NULL &&
         strstr(result, "Compile command:") == NULL &&
         strstr(result, "Link command:") == NULL &&
         strstr(result, "Run command:") == NULL &&
         strstr(result, "Result: success") != NULL;
    if (!ok) {
        (void)printf("M289 native failed: DCL procedure success path.\n%s\n",
                     result != NULL ? result : "<null>");
    }
    free(result);
    return ok;
}

static int test_compile_failure(agent_state *state)
{
    char *result;
    unsigned long status;
    int ok;

    reset_exec(1);
    status = 0UL;
    result = m289_build_source(state, "WC.MAR", &status);
    ok = result != NULL &&
         exec_calls == 1U &&
         status == 2UL &&
         strstr(result, "Link: not run because compile failed.") != NULL &&
         strstr(result, "Result: failure") != NULL;
    if (!ok) {
        (void)puts("M289 native failed: compile-failure sequencing.");
    }
    free(result);
    return ok;
}

static int test_java_compile_failure(agent_state *state)
{
    char *result;
    unsigned long status;
    int ok;

    reset_exec(1);
    status = 0UL;
    result = m289_build_source(state, "M289JavaFixture.java", &status);
    ok = result != NULL &&
         exec_calls == 1U &&
         status == 2UL &&
         strstr(result, "Compile status: %X00000002 (failure)") != NULL &&
         strstr(result, "Link:") == NULL &&
         strstr(result, "Run command:") == NULL &&
         strstr(result, "Result: failure") != NULL;
    if (!ok) {
        (void)puts("M289 native failed: Java compile-only failure.");
    }
    free(result);
    return ok;
}

static int test_link_failure(agent_state *state)
{
    char *result;
    unsigned long status;
    int ok;

    reset_exec(2);
    status = 0UL;
    result = m289_build_source(state, "M289_CXX_FIXTURE.CXX", &status);
    ok = result != NULL &&
         exec_calls == 2U &&
         status == 2UL &&
         strstr(result, "Link status: %X00000002 (failure)") != NULL &&
         strstr(result, "Result: failure") != NULL;
    if (!ok) {
        (void)puts("M289 native failed: link-failure sequencing.");
    }
    free(result);
    return ok;
}

static int test_refusal(agent_state *state)
{
    char *result;
    unsigned long status;
    int ok;

    reset_exec(3);
    status = 99UL;
    result = m289_build_source(state, "M289_CXX_FIXTURE.CXX", &status);
    ok = result != NULL &&
         exec_calls == 1U &&
         status == 0UL &&
         strstr(result, "Compile execution refused or unavailable.") != NULL &&
         strstr(result, "full approval policy required") != NULL;
    if (!ok) {
        (void)puts("M289 native failed: DCL refusal propagation.");
    }
    free(result);
    return ok;
}

static int test_java_refusal(agent_state *state)
{
    char *result;
    unsigned long status;
    int ok;

    reset_exec(3);
    status = 99UL;
    result = m289_build_source(state, "M289JavaFixture.java", &status);
    ok = result != NULL &&
         exec_calls == 1U &&
         status == 0UL &&
         strstr(result, "Compile execution refused or unavailable.") != NULL &&
         strstr(result, "full approval policy required") != NULL;
    if (!ok) {
        (void)puts("M289 native failed: Java DCL refusal propagation.");
    }
    free(result);
    return ok;
}

static int test_python_refusal(agent_state *state)
{
    char *result;
    unsigned long status;
    int ok;

    reset_exec(3);
    status = 99UL;
    result = m289_build_source(state, "M289_PYTHON_FIXTURE.PY", &status);
    ok = result != NULL &&
         exec_calls == 1U &&
         status == 0UL &&
         strstr(result, "Run execution refused or unavailable.") != NULL &&
         strstr(result, "full approval policy required") != NULL;
    if (!ok) {
        (void)puts("M289 native failed: interpreted DCL refusal propagation.");
    }
    free(result);
    return ok;
}

static int test_dcl_refusal(agent_state *state)
{
    char *result;
    unsigned long status;
    int ok;

    reset_exec(3);
    status = 99UL;
    result = m289_build_source(state, "M289_DCL_FIXTURE.COM", &status);
    ok = result != NULL &&
         exec_calls == 1U &&
         status == 0UL &&
         strstr(result, "Procedure execution refused or unavailable.") != NULL &&
         strstr(result, "full approval policy required") != NULL;
    if (!ok) {
        (void)puts("M289 native failed: DCL procedure refusal propagation.");
    }
    free(result);
    return ok;
}

static int test_invalid_source(agent_state *state)
{
    char *result;
    unsigned long status;
    int ok;

