mostangrymike/ovms-agent/SRC/M289_NATIVE_BUILD_TEST.C
    reset_exec(0);
    status = 0UL;
    result = m289_build_source(state, "../WC.MAR", &status);
    ok = result != NULL && exec_calls == 0U &&
         strstr(result, "unsafe project-relative source path") != NULL;
    free(result);
    if (!ok) {
        (void)puts("M289 native failed: unsafe source path.");
        return 0;
    }

    reset_exec(0);
    result = m289_build_source(state, "WC.UNSUPPORTED", &status);
    ok = result != NULL && exec_calls == 0U &&
         strstr(result, "No native profile accepts source extension") != NULL;
    free(result);
    if (!ok) {
        (void)puts("M289 native failed: unsupported source rejection.");
        return 0;
    }
    return 1;
}

int main(void)
{
    agent_state state;
    int ok;

    (void)memset(&state, 0, sizeof(state));
    state.project_root = ".";
    state.write_enabled = 1;
    state.dcl_enabled = 1;

    ok = test_command_guard() &&
         test_macro_success(&state) &&
         test_fortran_success(&state) &&
         test_cobol_success(&state) &&
         test_pascal_success(&state) &&
         test_cxx_success(&state) &&
         test_basic_success(&state) &&
         test_python_success(&state) &&
         test_perl_success(&state) &&
         test_java_success(&state) &&
         test_dcl_success(&state) &&
         test_compile_failure(&state) &&
         test_java_compile_failure(&state) &&
         test_link_failure(&state) &&
         test_refusal(&state) &&
         test_java_refusal(&state) &&
         test_python_refusal(&state) &&
         test_dcl_refusal(&state) &&
         test_invalid_source(&state);

    if (!ok) {
        (void)puts("M289 native build executor test failed.");
        return 2;
    }

    (void)puts("M289 native build executor test passed.");
    return 1;
}
